app/controllers/customers_controller.rb

  def index
    @customers = Customer.all.joins('LEFT OUTER JOIN records on customers.id = records.customer_id').order('records.updated_at DESC').uniq

    @debit_sum = Record.sum('debit')
    @credit_sum = Record.sum('credit')
    @bad_sum = Record.sum('bad')
---
SELECT DISTINCT `customers`.* FROM `customers` LEFT OUTER JOIN records on customers.id = records.customer_id  ORDER BY records.updated_at DESC
SELECT SUM(`records`.`debit`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')
SELECT SUM(`records`.`credit`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')
SELECT SUM(`records`.`bad`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')

  def create
    #render plain: params[:customer].inspect
    @customer = Customer.new(customer_params)
    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`cname`, `phone_no`, `tenant_id`, `created_at`, `updated_at`) VALUES ('客户', '', 1, '2016-02-14 12:23:29', '2016-02-14 12:23:29')

  def edit
    if Customer.find_by_id(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

  def update
    if Customer.find_by_id(params[:id])
      @customer = Customer.find(params[:id])

      if @customer.update(customer_params)
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
UPDATE `customers` SET `cname` = '客户1', `updated_at` = '2016-02-14 12:51:00' WHERE `customers`.`id` = 1

  def show
    if Customer.find_by_id(params[:id])
      @customer = Customer.find(params[:id])
      @records = @customer.records
      @debit_sum = @customer.records.sum("debit")
      @credit_sum = @customer.records.sum("credit")
      @bad_sum = @customer.records.sum("bad")
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
SELECT SUM(`records`.`debit`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')
SELECT `records`.* FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')
SELECT SUM(`records`.`credit`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')
SELECT SUM(`records`.`bad`) FROM `records` WHERE `records`.`customer_id` = 1 AND (left(updated_at,4) ='2016')