app/controllers/records_controller.rb

  def create
    @customer = Customer.find(params[:customer_id])
    @record = @customer.records.new(record_params)
    @record.tenant_id = @customer.tenant_id
    respond_to do |format|
      if @record.save
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1
INSERT INTO `records` (`updated_at`, `debit`, `credit`, `bad`, `customer_id`, `created_at`) VALUES ('2016-02-14 00:00:00', 100.0, 0.0, 0.0, 1, '2016-02-14 12:48:42')