app/controllers/welcome_controller.rb

  def set_role
    #
    @tenant = Tenant.find_by_id(params[:tenant_id])
---
SELECT  `tenants`.* FROM `tenants` WHERE `tenants`.`id` = 1  ORDER BY `tenants`.`id` ASC LIMIT 1