app/controllers/welcome_controller.rb

SELECT `books`.* FROM `books` WHERE `books`.`tenant_id` = 1
---
def index
    @books = Book.all.where(tenant_id: current_tenant.id)